import { v4 as uuidv4 } from 'uuid';

import { IProduct } from '@/types/IPhoto';

export const content: IProduct[] = [
    {
        id: uuidv4(),
        title: '6604-2',
        description:
            'Практичный женский рюкзак. Материал верха - экокожа. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: карман для мелочей на передней стенке, карман на молнии на задней стенке. Снаружи: карман на магнитном замочке и карман на молнии спереди, карман на молнии сзади, карманы по бокам.',
        url: './src/assets/images/6604-2__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '6701-2',
        description:
            'Женская сумка с одной ручкой и регулируемым ремнем на плечо, повседневная, деловая, в офис. Материал верха - экокожа, текстиль. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: карман для мелочей на передней стенке, карман на молнии на задней стенке. Снаружи: карман сзади.',
        url: './src/assets/images/6701-2__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '6701-3',
        description:
            'Рюкзак женский городской повседневный с ручкой и регулируемыми ремнями. Материал верха - экокожа, текстиль. Материал подкладки - полиэстер. Одно отделение на молнии с перегородкой. Внутри: карман для мелочей на передней стенке, карман на молнии на задней стенке. Снаружи: карман на молнии сзади.',
        url: './src/assets/images/6701-3__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '6702-3',
        description:
            'Маленькая женская сумочка на плечо, через плечо (кросс-боди), с регулируемым ремешком, вечерняя, на свадьбу. Материал верха - нейлон, экокожа. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: карман для мелочей на передней стенке, карман на молнии на задней стенке. Снаружи: карман на молнии спереди, карман на молнии сзади. Максимальная длина регулируемого ремешка - 120 см.',
        url: './src/assets/images/6702-3__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '6708-2',
        description:
            'Женская сумка на плечо, через плечо, с регулируемым ремешком, повседневная. Материал верха - экокожа. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: карман для мелочей на передней стенке, карман на молнии на задней стенке. Снаружи: карман на молнии и карман на магнитной кнопке спереди, карман на молнии сзади. Максимальная длина регулируемого ремешка - 120 см.',
        url: './src/assets/images/6708-2__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '6748-2',
        description:
            'Рюкзак женский городской повседневный с ручкой и регулируемыми ремнями. Материал верха - экокожа. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: карман для мелочей на передней стенке, отделение для планшета и карман на молнии на задней стенке. Снаружи: карман на молнии спереди, карман на молнии сзади.',
        url: './src/assets/images/6748-2__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '905504',
        description:
            'Практичный рюкзак унисекс. Материал верха - экокожа. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: два кармана для мелочей на передней стенке, отделение для планшета на задней стенке. Снаружи: карман на молнии спереди, карман на молнии сзади.',
        url: './src/assets/images/905504__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: '906601',
        description:
            'Небольшая мужская сумка на длинном ремне. Материал верха - искусственная кожа. Материал подкладки - полиэстер. Одно отделение на молнии. Внутри: карман для мелочей на передней стенке, карман на молнии на задней стенке. Снаружи: карман на молнии и карман без застежки спереди, карман на молнии сзади.',
        url: './src/assets/images/906601__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: 'P107-352',
        description:
            'Женское портмоне с одним отделением на молнии. Материал верха - экокожа. Материал подкладки - полиэстер. Внутри перегородки, отделения для монет и пластиковых карточек. Сзади карман на молнии.',
        url: './src/assets/images/P107-352__1.jpg',
        comments: [],
    },
    {
        id: uuidv4(),
        title: 'P110-510',
        description:
            'Женское портмоне с одним отделением на молнии. Материал верха - экокожа. Материал подкладки - полиэстер. Внутри: перегородки, отделения для монет и пластиковых карточек.',
        url: './src/assets/images/P110-510__1.jpg',
        comments: [],
    },
];
